Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/command-console/source/iperf/rtos/iperf_sockets.c
/*
 * Copyright 2024, Cypress Semiconductor Corporation (an Infineon company) or
 * an affiliate of Cypress Semiconductor Corporation.  All rights reserved.
 *
 * This software, including source code, documentation and related
 * materials ("Software") is owned by Cypress Semiconductor Corporation
 * or one of its affiliates ("Cypress") and is protected by and subject to
 * worldwide patent protection (United States and foreign),
 * United States copyright laws and international treaty provisions.
 * Therefore, you may use this Software only as provided in the license
 * agreement accompanying the software package from which you
 * obtained this Software ("EULA").
 * If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
 * non-transferable license to copy, modify, and compile the Software
 * source code solely for use in connection with Cypress's
 * integrated circuit products.  Any reproduction, modification, translation,
 * compilation, or representation of this Software except as specified
 * above is prohibited without the express written permission of Cypress.
 *
 * Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
 * EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
 * reserves the right to make changes to the Software without notice. Cypress
 * does not assume any liability arising out of the application or use of the
 * Software or any product or circuit described in the Software. Cypress does
 * not authorize its products for use in any products where a malfunction or
 * failure of the Cypress product may reasonably be expected to result in
 * significant property damage, injury or death ("High Risk Product"). By
 * including Cypress's product in a High Risk Product, the manufacturer
 * of such system or application assumes all risk of such use and in doing
 * so agrees to indemnify Cypress against all liability.
 */

/** @file
 * Implementation of socket layer APIs using Anycloud
 * Secure sockets library used by IPERF
 */
#include "cy_secure_sockets.h"
#include "iperf_sockets.h"
#ifdef COMPONENT_LWIP
#include "lwipopts.h"
#endif
#ifdef COMPONENT_NETXDUO
#include "nx_user.h"
#include "whd.h"
#endif
#include "cyabs_rtos_impl.h"
#include "cyabs_rtos.h"
#include <time.h>

#ifdef COMPONENT_NETXDUO
#ifndef DEFAULT_TCP_WINDOW_SIZE
#define DEFAULT_TCP_WINDOW_SIZE     (16 * 1024)
#endif

#ifndef NX_TCP_MAXIMUM_TX_QUEUE
/* Default value set is 20 */
#define NX_TCP_MAXIMUM_TX_QUEUE     (20)
#endif /* NX_TCP_MAXIMUM_TX_QUEUE */

#ifndef COMPONENT_CAT5
#define TX_BUFFER_PAYLOAD_SIZE      (WHD_LINK_MTU)
#define CY_NX_TCP_SND_BUF           (NX_TCP_MAXIMUM_TX_QUEUE*TX_BUFFER_PAYLOAD_SIZE)
#endif /* !COMPONENT_CAT5 */

#ifdef COMPONENT_CAT5
#define TX_BUFFER_PAYLOAD_SIZE      (WHD_LINK_MTU + 20)
/* NX_TCP_MAXIMUM_TX_QUEUE is not configurable in CAT5(H1-CP) devices. Default value set is 20 */
#define CY_NX_TCP_SND_BUF           (NX_TCP_MAXIMUM_TX_QUEUE*TX_BUFFER_PAYLOAD_SIZE)
#endif /* COMPONENT_CAT5 */

#endif

#define IPERF_SOCKET_DEBUG(x) //printf x
#define IPERF_SOCKET_ERROR(x) //printf x

#ifndef MAX_BSD_SOCKETS
#define MAX_BSD_SOCKETS                      (5)
#endif

#define BUFFER_LENGTH                        (100)
#ifdef DEFAULT_IPERF_SERVER_TIMEOUT_SEC
#define UDP_RECEIVE_TIMEOUT                  (500)
#else
#define UDP_RECEIVE_TIMEOUT                  (10000)
#endif
/* convert into ms */
#define CONVERT_TO_MS                        (1000)
#define ANYCLOUD_RECV_SOCKET_TIMEOUT_ERROR   (-3)
/******************************************************
 *                 Type Definitions
 ******************************************************/

/******************************************************
 *                   Enumerations
 ******************************************************/

/******************************************************
 *                    Structures
 ******************************************************/

typedef struct
{
    int               protocol_type;
    bool              available;
    uint32_t          select_timeout;
    struct sockaddr   remoteAddress;
    cy_socket_t       client_socket;
    cy_socket_t       socket;
    char              rcv_buffer[BUFFER_LENGTH];
    int               rcv_buffer_len;
    int               id;
} bsd_socket_t;

static bsd_socket_t   sockets[MAX_BSD_SOCKETS];
static bool           socket_layer_inited = false;
cy_mutex_t            sockets_mutex;
#ifdef DEFAULT_IPERF_SERVER_TIMEOUT_SEC
static uint32_t       udp_recv_retry = 0;
#endif

void iperf_network_init( void * networkInterface )
{
    if(socket_layer_inited != true)
    {
        sockets_layer_init();
    }
}

void sockets_layer_init( void )
{
    cy_rslt_t  result = CY_RSLT_SUCCESS;

    /* Initialize secure socket library */
    cy_socket_init();

    result = cy_rtos_init_mutex(&sockets_mutex);
    if( CY_RSLT_SUCCESS != result )
    {
        cy_socket_deinit();
        return;
    }

    int a;
    for ( a = 0; a < MAX_BSD_SOCKETS; ++a )
    {
        sockets[a].available = true;
        sockets[a].select_timeout = 0;
        sockets[a].id = a;
    }

    socket_layer_inited = true;
}

bsd_socket_t* find_free_socket()
{
    int a = 0;
    bsd_socket_t* free_socket = NULL;
    cy_rslt_t     result = CY_RSLT_SUCCESS;

    result = cy_rtos_get_mutex(&sockets_mutex, CY_RTOS_NEVER_TIMEOUT);
    if( CY_RSLT_SUCCESS != result )
    {
        return free_socket;
    }
    for ( ; a < MAX_BSD_SOCKETS; ++a )
    {
        if ( sockets[a].available == true )
        {
            free_socket = &sockets[a];
            memset(free_socket, 0, sizeof(bsd_socket_t));
            free_socket->available        = false;
            free_socket->select_timeout   = 0;
            free_socket->id = a;
            break;
        }
    }

    result = cy_rtos_set_mutex(&sockets_mutex);
    if( CY_RSLT_SUCCESS != result )
    {
        if( free_socket != NULL )
        {
            free_socket->available = true;
        }
        return NULL;
    }

    return free_socket;
}

void convert_from_lwip_to_secure_sockets(int protocolfamily, int type, int* domain, int* stream_type)
{
    if(protocolfamily == AF_INET)
    {
        *domain = CY_SOCKET_DOMAIN_AF_INET;
    }
    else
    {
        *domain = CY_SOCKET_DOMAIN_AF_INET6;
    }

