Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/command-console/source/iperf/rtos/iperf_sockets.c
    if(type == SOCK_STREAM)
    {
        *stream_type = CY_SOCKET_TYPE_STREAM;
    }
    else
    {
        *stream_type = CY_SOCKET_TYPE_DGRAM;
    }
}

int iperf_socket( int protocolFamily, int type, int protocol )
{
    cy_rslt_t result;
    int id=0;
    bsd_socket_t* free_socket;
    int domain, stream_type;
    IPERF_SOCKET_DEBUG(("iperf_socket : Creating sockets \n"));

    /* Find free socket */
    free_socket = find_free_socket();
    if(free_socket == NULL)
    {
        IPERF_SOCKET_DEBUG(("Failed to find free socket \n"));
        return -1;
    }

    id = free_socket->id;

    convert_from_lwip_to_secure_sockets(protocolFamily, type, &domain, &stream_type);

    switch ( type )
    {
        case SOCK_DGRAM:
            free_socket->protocol_type = CY_SOCKET_IPPROTO_UDP;

            result = cy_socket_create(domain, stream_type, free_socket->protocol_type, &free_socket->socket);
            if(result != CY_RSLT_SUCCESS)
            {
                IPERF_SOCKET_DEBUG(("cy_socket_create failed with error %d\r\n", result));
                id = -1;
                goto exit;
            }
#ifdef DEFAULT_IPERF_SERVER_TIMEOUT_SEC
            udp_recv_retry = 0;
#endif
            break;

        case SOCK_STREAM:
            free_socket->protocol_type = CY_SOCKET_IPPROTO_TCP;

            result = cy_socket_create(domain, stream_type, free_socket->protocol_type, &free_socket->socket);
            if(result != CY_RSLT_SUCCESS)
            {
                IPERF_SOCKET_DEBUG(("cy_socket_create failed with error %d\r\n", result));
                id = -1;
                goto exit;
            }
            break;
        default:
            IPERF_SOCKET_DEBUG(("Invalid socket type \n"));
            id = -1;
            goto exit;
    }

    IPERF_SOCKET_DEBUG(("iperf_socket : Done \n"));
    return id;

exit:
    IPERF_SOCKET_DEBUG(("iperf_socket : Done with error \n"));
    memset(free_socket,0,sizeof(bsd_socket_t));
    free_socket->available = true;
    return id;
}


int iperf_write( int sockID, const char *msg, size_t msgLength )
{
    uint32_t  bytes_sent = 0;
    cy_rslt_t result = CY_RSLT_SUCCESS;

    IPERF_SOCKET_DEBUG(("iperf_write : Write on socket with length : %d \r\n", msgLength));

    switch ( sockets[sockID].protocol_type )
    {
        case CY_SOCKET_IPPROTO_TCP:
        {
            /* cy_socket_send may return CY_RSLT_MODULE_SECURE_SOCKETS_WOULDBLOCK for lower network speeds which means that the socket send buffer is full.
             * Example: This situation can occur with ethernet link with 10M speed. The application posts packets to network stack at a faster rate than
             * it can be sent out through the network and the send buffer might overflow returning CY_RSLT_MODULE_SECURE_SOCKETS_WOULDBLOCK.
             * In such situation, we can send the packet again so that when the send buffer is freed after sometime, cy_socket_send returns success.
             */
            do
            {
                result = cy_socket_send(sockets[sockID].socket, msg, msgLength, 0, &bytes_sent);
            } while(result == CY_RSLT_MODULE_SECURE_SOCKETS_WOULDBLOCK);

            if( result != CY_RSLT_SUCCESS)
            {
                IPERF_SOCKET_ERROR(("cy_socket_send failed with error : %ld \n", result));
                return -1;
            }
            break;
        }
        case CY_SOCKET_IPPROTO_UDP:
        {
            cy_socket_sockaddr_t address;

            struct sockaddr* socket_addr = &sockets[sockID].remoteAddress;

            /* Fill Port number, IP address into cy_socket_sockaddr_t format */
            address.port = ((uint16_t)socket_addr->sa_data[0]) << 8;
            address.port |= socket_addr->sa_data[1];
            address.ip_address.version = CY_SOCKET_IP_VER_V4;
            address.ip_address.ip.v4 = (socket_addr->sa_data[2]) | (socket_addr->sa_data[3] << 8) | (socket_addr->sa_data[4] << 16) | (socket_addr->sa_data[5] << 24);

            result = cy_socket_sendto(sockets[sockID].socket, msg, msgLength, 0, &address, sizeof(cy_socket_sockaddr_t), &bytes_sent);
            if(result != CY_RSLT_SUCCESS)
            {
                IPERF_SOCKET_ERROR(("cy_socket_sendto failed with error : %ld \n", result));
                return -1;
            }

            break;
        }
        default:
        {
            IPERF_SOCKET_DEBUG(("Invalid protocol type \n"));
            return -1;
            break;
        }
    }

    IPERF_SOCKET_DEBUG(("iperf_write : Done, Status %d\n", bytes_sent));

    return bytes_sent;
}

int iperf_read(int sockID, void *mem, size_t len)
{
    uint32_t bytes_received = 0;
    cy_rslt_t result = CY_RSLT_SUCCESS;

    uint32_t address_length = 0;

    IPERF_SOCKET_DEBUG(("IPERF_read with length : %d\n", len));

    switch ( sockets[sockID].protocol_type )
    {
        case CY_SOCKET_IPPROTO_TCP:
        {
            if(sockets[sockID].client_socket)
            {
                result = cy_socket_recv(sockets[sockID].client_socket, mem, len, CY_SOCKET_FLAGS_NONE, &bytes_received);
                if(result != CY_RSLT_SUCCESS)
                {
                    IPERF_SOCKET_ERROR(("cy_socket_recv failed with error : %ld \n", result));
                    return -1;
                }
            }
            break;
        }
        case CY_SOCKET_IPPROTO_UDP:
        {
            if(sockets[sockID].socket)
            {
                cy_socket_sockaddr_t src_addr;
                struct sockaddr* socket_addr = &sockets[sockID].remoteAddress;

                /* Fill port number, IP address in cy_socket_sockaddr_t format */
                src_addr.ip_address.version = CY_SOCKET_IP_VER_V4;
                src_addr.port = ((uint16_t)socket_addr->sa_data[0]) << 8;
                src_addr.port |= socket_addr->sa_data[1];
                src_addr.ip_address.ip.v4 = (socket_addr->sa_data[2]) | (socket_addr->sa_data[3] << 8) | (socket_addr->sa_data[4] << 16) | (socket_addr->sa_data[5] << 24);
                address_length = sizeof(cy_socket_sockaddr_t);

                result = cy_socket_recvfrom(sockets[sockID].socket, mem, len, CY_SOCKET_FLAGS_RECVFROM_SRC_FILTER, &src_addr, &address_length, &bytes_received);
                if(result != CY_RSLT_SUCCESS)
                {
                    IPERF_SOCKET_ERROR(("cy_socket_recvfrom failed with error : %ld \n", result));
                    return -1;
                }
            }
            break;
        }
        default:
        {
            IPERF_SOCKET_DEBUG(("Invalid protocol type \n"));
            bytes_received = -1;
            break;
        }
    }

    IPERF_SOCKET_DEBUG(("iperf_read : Done, Status %d \n", bytes_received));

    return bytes_received;
}

int iperf_getpeername(int sockID, struct sockaddr *remoteAddress, uint32_t *addressLength)
{
    IPERF_SOCKET_DEBUG(("getpeername\n"));
    return 0;
}

int iperf_getsockname(int sockID, struct sockaddr *localAddress, uint32_t *addressLength)
{
    IPERF_SOCKET_DEBUG(("getsockname\n"));
    return 0;
}

