Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/command-console/source/iperf/rtos/iperf_sockets.c
int iperf_recvfrom(int sockID, char *buffer, size_t buffersize, int flags,struct sockaddr *fromAddr, uint32_t *fromAddrLen)
{
    uint32_t bytes_received = 0;
    uint32_t address_length = 0;
    cy_rslt_t result = CY_RSLT_SUCCESS;

#ifdef DEFAULT_IPERF_SERVER_TIMEOUT_SEC
    uint32_t timeout = DEFAULT_IPERF_SERVER_TIMEOUT_SEC*1000;
#else
#ifdef COMPONENT_NETXDUO
    uint32_t timeout = NX_WAIT_FOREVER;
#else
    int timeout = 0;
#endif
#endif
    IPERF_SOCKET_DEBUG(("iperf_recvfrom : Read data with buffer length : %d \r\n", buffersize));

    cy_socket_sockaddr_t src_addr;
    address_length = sizeof(cy_socket_sockaddr_t);

    /* set the receive timeout to block till UDP datagram is received from Client */
    result = cy_socket_setsockopt(sockets[sockID].socket, CY_SOCKET_SOL_SOCKET, CY_SOCKET_SO_RCVTIMEO, &timeout, sizeof(int));
    if ( result != CY_RSLT_SUCCESS)
    {
        IPERF_SOCKET_ERROR(("Failed to set RCV timeout option : %d \n", result));
        return -1;
    }

    result = cy_socket_recvfrom(sockets[sockID].socket, buffer, buffersize, CY_SOCKET_FLAGS_RECVFROM_NONE, &src_addr, &address_length, &bytes_received);
    if(result != CY_RSLT_SUCCESS)
    {
        IPERF_SOCKET_ERROR(("cy_socket_recvfrom failed with error : %ld \n", result));
        return -1;
    }

    /* Copy received peer port number and IP address into fromAddr */
    fromAddr->sa_data[0] = (src_addr.port >> 8) & 0XFF;
    fromAddr->sa_data[1] = (src_addr.port) & 0xFF;
    memcpy(&fromAddr->sa_data[2], &src_addr.ip_address.ip.v4, sizeof(uint32_t));

    IPERF_SOCKET_DEBUG(("iperf_recvfrom : Done, Status : %d \r\n", bytes_received));

    /* set the UDP receive timeout */
    timeout = UDP_RECEIVE_TIMEOUT;
    result = cy_socket_setsockopt(sockets[sockID].socket, CY_SOCKET_SOL_SOCKET, CY_SOCKET_SO_RCVTIMEO, &timeout, sizeof(int));
    if ( result != CY_RSLT_SUCCESS)
    {
        IPERF_SOCKET_ERROR(("Failed to set RCV timeout option : %d \n", result));
        return -1;
    }

    return bytes_received;
}

int iperf_recv(int sockID, void *rcvBuffer, size_t bufferLength, int flags)
{
    uint32_t bytes_received=0;
    uint32_t address_length = 0;
    cy_rslt_t result = CY_RSLT_SUCCESS;
    int received_data_length = 0;
    int remaining_data_length  = bufferLength;

    IPERF_SOCKET_DEBUG(("iperf_recv : Read data with buffer length : %d\n", bufferLength));

    if((flags & MSG_PEEK) != MSG_PEEK)
    {
        if(sockets[sockID].rcv_buffer_len != 0)
        {
            memcpy(rcvBuffer, sockets[sockID].rcv_buffer, sockets[sockID].rcv_buffer_len);
            memset(sockets[sockID].rcv_buffer, 0, sizeof(sockets[sockID].rcv_buffer));
            received_data_length += sockets[sockID].rcv_buffer_len;
            remaining_data_length -= sockets[sockID].rcv_buffer_len;
            sockets[sockID].rcv_buffer_len = 0;
        }
    }

    switch ( sockets[sockID].protocol_type )
    {
        case CY_SOCKET_IPPROTO_TCP:
        {
            if(sockets[sockID].client_socket)
            {
                while(received_data_length < bufferLength)
                {
                    result = cy_socket_recv(sockets[sockID].client_socket, ((char*)rcvBuffer) + received_data_length, remaining_data_length, CY_SOCKET_FLAGS_NONE, &bytes_received);
                    if(result != CY_RSLT_SUCCESS)
                    {
                        IPERF_SOCKET_ERROR(("cy_socket_recv failed with error : %d \n", result));
                        return -1;
                    }

                    remaining_data_length -= bytes_received;
                    received_data_length += bytes_received;
                }
            }
            break;
        }
        case CY_SOCKET_IPPROTO_UDP:
        {
            if(sockets[sockID].socket)
            {
                cy_socket_sockaddr_t src_addr;

                struct sockaddr* socket_addr = &sockets[sockID].remoteAddress;

                /* Fill port number, IP address to cy_socket_sockaddr_t format */
                src_addr.port = ((uint16_t)socket_addr->sa_data[0]) << 8;
                src_addr.port |= socket_addr->sa_data[1];
                src_addr.ip_address.version = CY_SOCKET_IP_VER_V4;
                src_addr.ip_address.ip.v4 = (socket_addr->sa_data[2]) | (socket_addr->sa_data[3] << 8) | (socket_addr->sa_data[4] << 16) | (socket_addr->sa_data[5] << 24);
                address_length = sizeof(cy_socket_sockaddr_t);

                while(received_data_length < bufferLength)
                {
                    result = cy_socket_recvfrom(sockets[sockID].socket, ((char*)rcvBuffer) + received_data_length, remaining_data_length, CY_SOCKET_FLAGS_RECVFROM_SRC_FILTER, &src_addr, &address_length, &bytes_received);

                    if(result == CY_RSLT_MODULE_SECURE_SOCKETS_TIMEOUT)
                    {
                        IPERF_SOCKET_ERROR(("cy_socket_recvfrom failed with Timeout error : %d \n", result));
#ifdef DEFAULT_IPERF_SERVER_TIMEOUT_SEC
                        udp_recv_retry ++;
                        if(udp_recv_retry >= (DEFAULT_IPERF_SERVER_TIMEOUT_SEC*2))
                        {
                            return -1;
                        }
#endif
                        return ANYCLOUD_RECV_SOCKET_TIMEOUT_ERROR;
                    } else if(result != CY_RSLT_SUCCESS)
                    {
                        IPERF_SOCKET_ERROR(("cy_socket_recvfrom failed with error : %d \n", result));
                        return -1;
                    } else
                    {
                      //DO Nothing
                    }
#ifdef DEFAULT_IPERF_SERVER_TIMEOUT_SEC
                    udp_recv_retry = 0;
#endif
                    remaining_data_length -= bytes_received;
                    received_data_length += bytes_received;
                }
            }
            break;
        }
        default:
        {
            IPERF_SOCKET_DEBUG(("Invalid protocol type \n"));
            bytes_received = -1;
            break;
        }
    }

    /* Copy read data to buffer if MSG_PEEK flag is set */
    if((flags & MSG_PEEK) == MSG_PEEK)
    {
        memcpy(sockets[sockID].rcv_buffer + sockets[sockID].rcv_buffer_len, rcvBuffer, bytes_received);
        sockets[sockID].rcv_buffer_len += bytes_received;
    }

