Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/command-console/source/iperf/rtos/iperf_sockets.c
    IPERF_SOCKET_DEBUG(("iperf_recv : Done, Status %d \n", bytes_received));

    return bytes_received;
}

int iperf_accept(int sockID, struct sockaddr *ClientAddress, uint32_t *addressLength)
{
    uint32_t address_length = 0;
    cy_socket_sockaddr_t address;
    cy_rslt_t result = CY_RSLT_SUCCESS;

    IPERF_SOCKET_DEBUG(("iperf_accept : Accept new client connection \n"));

    switch ( sockets[sockID].protocol_type )
    {
        case CY_SOCKET_IPPROTO_TCP:
        {
            struct sockaddr* socket_addr = ClientAddress;

#ifdef DEFAULT_IPERF_SERVER_TIMEOUT_SEC
            uint32_t time_ms = (DEFAULT_IPERF_SERVER_TIMEOUT_SEC*1000)/2;
#endif

            /* Fill port number, IP address into cy_socket_sockaddr_t format */
            address.port = ((uint16_t)socket_addr->sa_data[0]) << 8;
            address.port |= socket_addr->sa_data[1];
            address.ip_address.version = CY_SOCKET_IP_VER_V4;
            address.ip_address.ip.v4 = (socket_addr->sa_data[2]) | (socket_addr->sa_data[3] << 8) | (socket_addr->sa_data[4] << 16) | (socket_addr->sa_data[5] << 24);
            address_length = sizeof(cy_socket_sockaddr_t);

            result = cy_socket_accept(sockets[sockID].socket, &address, &address_length, &sockets[sockID].client_socket);
            if(result != CY_RSLT_SUCCESS)
            {
                IPERF_SOCKET_ERROR(("cy_socket_accept failed with error : %d \n", result));
                return -1;
            }
#ifdef DEFAULT_IPERF_SERVER_TIMEOUT_SEC
            result = cy_socket_setsockopt(sockets[sockID].client_socket, CY_SOCKET_SOL_SOCKET, CY_SOCKET_SO_RCVTIMEO, &time_ms, sizeof(time_ms));
            if ( result != CY_RSLT_SUCCESS)
            {
               IPERF_SOCKET_ERROR(("Failed to set RCV timeout option for client_socket: %d \n", result));
               return -1;
            }
#endif
            break;
        }
        case CY_SOCKET_IPPROTO_UDP:
        {
            IPERF_SOCKET_DEBUG(("Error: accept called on udp socket \n"));
            break;
        }
        default:
        {
            IPERF_SOCKET_DEBUG(("Invalid protocol type \n"));
            result = -1;
            break;
        }
    }

    IPERF_SOCKET_DEBUG(("iperf_accept : Done, Status %d\n", result));
    return sockID;
}

int iperf_listen(int sockID, int backlog)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;

    IPERF_SOCKET_DEBUG(("iperf_listen : Listen on socket \r\n"));

    switch ( sockets[sockID].protocol_type )
    {
        case CY_SOCKET_IPPROTO_TCP:
        {
            result = cy_socket_listen(sockets[sockID].socket, backlog);
            if(result != CY_RSLT_SUCCESS)
            {
                IPERF_SOCKET_ERROR(("cy_socket_listen failed with error : %d \n", result));
                return -1;
            }
            break;
        }
        case CY_SOCKET_IPPROTO_UDP:
        {
            IPERF_SOCKET_DEBUG(("Error: listen called on udp socket \n"));
            break;
        }
        default:
        {
            IPERF_SOCKET_DEBUG(("Invalid protocol type \n"));
            result = -1;
            break;
        }
    }

    IPERF_SOCKET_DEBUG(("iperf_listen : Done, Status %d\n", result));
    return result;
}

int iperf_bind(int sockID, struct sockaddr *localAddress, uint32_t addressLength)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    cy_socket_sockaddr_t address;

    IPERF_SOCKET_DEBUG(("iperf_bind : Bind to a socket \r\n"));

    switch ( sockets[sockID].protocol_type )
    {
        case CY_SOCKET_IPPROTO_TCP:
        case CY_SOCKET_IPPROTO_UDP:
        {

            /* Fill port number, IP address into cy_socket_sockaddr_t format */
            address.port = ((uint16_t)localAddress->sa_data[0]) << 8;
            address.port |= localAddress->sa_data[1];
            address.ip_address.version = CY_SOCKET_IP_VER_V4;
            address.ip_address.ip.v4 = (localAddress->sa_data[2]) | (localAddress->sa_data[3] << 8) | (localAddress->sa_data[4] << 16) | (localAddress->sa_data[5] << 24);

            result  = cy_socket_bind(sockets[sockID].socket, &address, sizeof(cy_socket_sockaddr_t));
            if(result != CY_RSLT_SUCCESS)
            {
                IPERF_SOCKET_ERROR(("cy_socket_setsockopt failed with error : %d \n", result));
                return -1;
            }
            break;
        }
        default:
        {
            IPERF_SOCKET_DEBUG(("Invalid protocol type \n"));
            result = -1;
            break;
        }
    }

    IPERF_SOCKET_DEBUG(("iperf_bind : Done, Status %d\n", result));
    return result;
}

int iperf_connect(int sockID, struct sockaddr *remoteAddress, uint32_t addressLength)
{
    uint32_t address_length = 0;

    cy_rslt_t result = CY_RSLT_SUCCESS;

    IPERF_SOCKET_DEBUG(("iperf_connect : Connect to a server \r\n"));

    switch ( sockets[sockID].protocol_type )
    {
        case CY_SOCKET_IPPROTO_TCP:
        {
            cy_socket_sockaddr_t address;

            address.port = ((uint16_t)remoteAddress->sa_data[0]) << 8;
            address.port |= remoteAddress->sa_data[1];
            address.ip_address.version = CY_SOCKET_IP_VER_V4;
            address.ip_address.ip.v4 = (remoteAddress->sa_data[2]) | (remoteAddress->sa_data[3] << 8) | (remoteAddress->sa_data[4] << 16) | (remoteAddress->sa_data[5] << 24);
            address_length = sizeof(cy_socket_sockaddr_t);

            result = cy_socket_connect(sockets[sockID].socket, &address, address_length);
            if(result != CY_RSLT_SUCCESS)
            {
                IPERF_SOCKET_ERROR(("cy_socket_connect failed with error : %d \n", result));
                return -1;
            }
            break;
        }
       case CY_SOCKET_IPPROTO_UDP:
       {
           memcpy(&sockets[sockID].remoteAddress, remoteAddress, sizeof(struct sockaddr) );
           result = 0;
           break;
       }
       default:
       {
           IPERF_SOCKET_DEBUG(("Invalid protocol type \n"));
           result = -1;
           break;
       }
   }

