Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/command-console/source/iperf/rtos/iperf_sockets.c
    IPERF_SOCKET_DEBUG(("iperf_connect : Done, Status %d\n", result));
    return result;
}

int iperf_close( int sockID)
{
    int ret = 0;
    cy_rslt_t result = CY_RSLT_SUCCESS;

    IPERF_SOCKET_DEBUG(("iperf_close : Close connection, socket id : %d \n", sockID));

    if(sockets[sockID].available == false)
    {
        switch ( sockets[sockID].protocol_type )
        {
            case CY_SOCKET_IPPROTO_TCP:
            {
                if(sockets[sockID].client_socket != NULL)
                {
                    result = cy_socket_disconnect(sockets[sockID].client_socket, 0);
                    if(result != CY_RSLT_SUCCESS)
                    {
                        IPERF_SOCKET_ERROR(("cy_socket_disconnect failed with error : %d \n", result));
                    }

                    result = cy_socket_delete(sockets[sockID].client_socket);
                    if(result != CY_RSLT_SUCCESS)
                    {
                        IPERF_SOCKET_ERROR(("cy_socket_delete failed with error : %d \n", result));
                    }
                }

                result = cy_socket_disconnect(sockets[sockID].socket, 0);
                if(result != CY_RSLT_SUCCESS)
                {
                    IPERF_SOCKET_ERROR(("cy_socket_disconnect failed with error : %d \n", result));
                }

                result = cy_socket_delete(sockets[sockID].socket);
                if(result != CY_RSLT_SUCCESS)
                {
                    IPERF_SOCKET_ERROR(("cy_socket_delete failed with error : %d \n", result));
                    return -1;
                }
                break;
            }
            case CY_SOCKET_IPPROTO_UDP:
            {
                result = cy_socket_delete(sockets[sockID].socket);
                if(result != CY_RSLT_SUCCESS)
                {
                    IPERF_SOCKET_ERROR(("cy_socket_delete failed with error : %d \n", result));
                    return -1;
                }
                break;
            }
            default:
            {
                IPERF_SOCKET_DEBUG(("Invalid protocol type \n"));
                ret = -1;
                break;
            }
        }
        sockets[sockID].available = true;
    }

    IPERF_SOCKET_DEBUG(("iperf_close : Done, Status : %d\n", result));
    return ret;
}

int iperf_setsockopt(int sockID, int option_level, int option_name, const void *option_value, uint32_t option_length)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;

    IPERF_SOCKET_DEBUG(("iperf_setsockopt : Set socket option : %d\n", option_name));
    /*
     * Socket options used by iperf:
     * Listener.cpp:
     * SO_REUSEADDR
     * IP_ADD_MEMBERSHIP
     * IPV6_ADD_MEMBERSHIP
     * IP_MULTICAST_TTL
     * IPV6_MULTICAST_HOPS
     *
     * PerfSocket.cpp:
     * TCP_CONGESTION
     * IP_MULTICAST_TTL
     * IPV6_MULTICAST_HOPS
     * IP_TOS
     * TCP_NODELAY
     *
     * tcp_window_size:
     * TCP_WINSHIFT
     * TCP_RFC1323
     * SO_RCVBUF
     * SO_SNDBUF
     */

    switch ( option_name )
    {
        case SO_REUSEADDR:
            IPERF_SOCKET_DEBUG(("SO_REUSEADDR\n"));
            break;
        case SO_SNDBUF:
            IPERF_SOCKET_DEBUG(("SO_SNDBUF %ld\n", (*(uint32_t*) option_value)));
            break;
        case SO_RCVBUF:
            IPERF_SOCKET_DEBUG(("SO_RCVBUF %ld\n", (*(uint32_t*) option_value)));
            break;
        case SO_RCVTIMEO:
        {
            struct timeval *tm = (struct timeval*) option_value;
            uint32_t *timeout = (uint32_t*)(&(tm->tv_sec));
            uint32_t time_ms = (uint32_t)(((*timeout) * CONVERT_TO_MS) + ((tm->tv_usec)/CONVERT_TO_MS));

            result = cy_socket_setsockopt(sockets[sockID].socket, CY_SOCKET_SOL_SOCKET, CY_SOCKET_SO_RCVTIMEO, &time_ms, sizeof(time_ms));
            if ( result != CY_RSLT_SUCCESS)
            {
                IPERF_SOCKET_ERROR(("Failed to set RCV timeout option : %d \n", result));
                return -1;
            }
            break;
        }

        case SO_SNDTIMEO:
        {
            struct timeval *tm = (struct timeval*) option_value;
            uint32_t *timeout = (uint32_t*)(&(tm->tv_sec));
            uint32_t time_ms = (uint32_t)(((*timeout) * CONVERT_TO_MS) + ((tm->tv_usec)/CONVERT_TO_MS));
            result = cy_socket_setsockopt(sockets[sockID].socket, CY_SOCKET_SOL_SOCKET, CY_SOCKET_SO_SNDTIMEO, &time_ms, sizeof(time_ms));
            if ( result != CY_RSLT_SUCCESS)
            {
                IPERF_SOCKET_ERROR(("Failed to set SND timeout option : %d \n", result));
                return -1;
            }
            break;
        }

        default:
            IPERF_SOCKET_DEBUG(("Setsockopt %d not supported\n", option_name));
            return -1;
    }
    return 0;
}

int iperf_getsockopt(int sockID, int option_level, int option_name, void *option_value,uint32_t *option_length)
{
    /* Socket options requested by iperf:
     * sockets.c:
     * TCP_MAXSEG
     *
     * tcp_window_size.c:
     * SO_SNDBUF
     * SO_RCVBUF
     */
    IPERF_SOCKET_DEBUG(("getsockopt %d\n", option_name));

    switch ( sockets[sockID].protocol_type )
    {
        case CY_SOCKET_IPPROTO_TCP:
            switch ( option_name )
            {
                case SO_SNDBUF:
#ifdef COMPONENT_NETXDUO
                    *(uint32_t*) option_value = CY_NX_TCP_SND_BUF;
#else
                    *(uint32_t*) option_value = TCP_SND_BUF;
#endif
                    *option_length = sizeof(uint32_t);
                    break;
                case SO_RCVBUF:
#ifdef COMPONENT_NETXDUO
                    *(uint32_t*) option_value = DEFAULT_TCP_WINDOW_SIZE;
#else
                    *(uint32_t*) option_value = TCP_WND;
#endif
                    *option_length = sizeof(uint32_t);
                    break;
                default:
                    IPERF_SOCKET_DEBUG(("Getsockopt %d not supported\n", option_name));
                    return -1;
            }
         break;
         case CY_SOCKET_IPPROTO_UDP:
            switch ( option_name )
            {
                case SO_SNDBUF:
                case SO_RCVBUF:
#ifdef COMPONENT_NETXDUO
                    *(uint32_t*) option_value = DEFAULT_TCP_WINDOW_SIZE;
#else
                    *(uint32_t*) option_value = TCP_WND;
#endif
                    *option_length = sizeof(uint32_t);
                    break;
                default:
                    IPERF_SOCKET_DEBUG(("Getsockopt %d not supported\n", option_name));
                    return -1;
            }
         break;
         default:
             IPERF_SOCKET_DEBUG(("Invalid protocol type \n"));
             return -1;
    }

