Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/command-console/source/iperf/rtos/iperf_sockets.c
    return 0;
}

int iperf_sendto(int sockID, char *msg, size_t msgLength, int flags, struct sockaddr *destAddr, uint32_t destAddrLen)
{
    IPERF_SOCKET_DEBUG(("iperf_sendto : Write data to socket with length : %d \n", msgLength));
    return 1;
}

int iperf_send(int sockID, const char *msg, size_t msgLength, int flags)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    uint32_t bytes_sent = 0;

    IPERF_SOCKET_DEBUG(("iperf_send : Write data to socket with length : %d \n", msgLength));

    switch ( sockets[sockID].protocol_type )
    {
        case CY_SOCKET_IPPROTO_TCP:
        {
            result = cy_socket_send(sockets[sockID].socket, msg, msgLength, 0, &bytes_sent);
            if(result != CY_RSLT_SUCCESS)
            {
                IPERF_SOCKET_ERROR(("cy_socket_send failed with error : %d \n", result));
                return -1;
            }

            break;
        }
        case CY_SOCKET_IPPROTO_UDP:
        {
            cy_socket_sockaddr_t address;

            struct sockaddr* socket_addr = &sockets[sockID].remoteAddress;

            /* Fill Port number, IP address into cy_socket_sockaddr_t format */
            address.port = ((uint16_t)socket_addr->sa_data[0]) << 8;
            address.port |= socket_addr->sa_data[1];
            address.ip_address.version = CY_SOCKET_IP_VER_V4;
            address.ip_address.ip.v4 = (socket_addr->sa_data[2]) | (socket_addr->sa_data[3] << 8) | (socket_addr->sa_data[4] << 16) | (socket_addr->sa_data[5] << 24);

            result = cy_socket_sendto(sockets[sockID].socket, msg, msgLength, 0, &address, sizeof(cy_socket_sockaddr_t), &bytes_sent);
            if(result != CY_RSLT_SUCCESS)
            {
                IPERF_SOCKET_ERROR(("cy_socket_sendto failed with error : %d \n", result));
                return -1;
            }
            break;
        }
        default:
        {
            IPERF_SOCKET_DEBUG(("Invalid protocol type \n"));
            bytes_sent = -1;
            break;
        }
    }

    IPERF_SOCKET_DEBUG(("iperf_send : Done, Status %d\n", bytes_sent));

    return bytes_sent;
}

#ifdef __cplusplus
extern "C" {
#endif

struct hostent* iperf_gethostbyname(const char *name)
{
    /* TODO: Implement code for resolving the hostname */
    IPERF_SOCKET_DEBUG(("gethostbyname \n"));
    return 0;
}

int  iperf_select( int nfds, fd_set *readfds, fd_set *writefds, fd_set *exceptfds, struct timeval *timeout )
{
    /*
     * iperf only uses select() in two places. Both are used to check if the socket is readable.
     * So instead of waiting here, we'll record the wait timeout and use it in the recv() call that follows
     */
    IPERF_SOCKET_DEBUG(("iperf_select \n"));
    return 1;
}

bool iperf_setsock_blocking (int fd, bool blocking) {

    IPERF_SOCKET_DEBUG(("iperf_setsock_blocking : Set the mode to blocking/non-blocking - %d \n", blocking));

    switch ( sockets[fd].protocol_type )
    {
        case CY_SOCKET_IPPROTO_TCP:
            break;

        case CY_SOCKET_IPPROTO_UDP:
            break;

        default:
            IPERF_SOCKET_DEBUG(("Invalid protocol type \n"));
            break;
    }

    return true;
}
